---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
source: html/a40efda7-6e2f-a455-f65e-02b10b0bc1b4.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal

A geometry vertex specified as a position in space with a normal vector.

## Syntax (C#)
```csharp
public class VertexPositionNormal : Vertex
```

## Remarks
Since these vertices do not have a color
 their color is obtained from the EffectInstance